santhoshkumar90253/STM32/35_UART_DMA_BareMetal/drivers/inc/stm32lxx.h
/*
 * STM32Lxx.h
 *
 *  Created on: Sep 11, 2025
 *      Author: HP
 */

#ifndef INC_STM32LXX_H_
#define INC_STM32LXX_H_
/**********************************************************************************************************************
 * INCLUDE FILES
**********************************************************************************************************************/
#include <stdint.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <stddef.h>

/************************************************* END OF INCLUDE FILES **********************************************/

/**********************************************************************************************************************
 * MACROS
 *********************************************************************************************************************/
/* Macro defined for volatile qualifier*/
#define __vo                        volatile

/*Generic Macro's */

#define ENABLE                      1
#define DISABLE                     0

#define SET                         1
#define RESET                       0

#define GPIO_PIN_SET   				1
#define GPIO_PIN_RESET 				0

#define SPI_FLAG_SET                1
#define SPI_FLAG_RESET              0
#define USART_FLAG_SET              1
#define USART_FLAG_RESET            0


/* base addresses of flash and SRAM memories */
/* Macro defined for flash base address */
#define FLASH_BASEADDR              0x08000000UL
/* Macro defined for SRAM 1 base address */
#define SRAM1_BASEADDR              0x20000000UL
/* Macro defined for SRAM 2 base address */
#define SRAM2_BASE_ADDR				0X20040000UL
/* Macro defined for ROM address */
#define ROM							0X1FFF0000UL
/* Macro defined for SRAM address */
#define SRAM                        SRAM1_BASEADDR

/* Base addresses of AHBx and APBx Bus peripheral */
/* Macro defined for peripheral base address */
#define PERIPH_BASE                 0X40000000UL
/* Macro defined for APB1 Base address */
#define APB1_BASE_ADDR              PERIPH_BASE
/* Macro defined for APB2 Base address */
#define APB2_BASE_ADDR              0X40010000UL
/* Macro defined for AHB1 Base address */
#define AHB1_BASE_ADDR              0X40020000UL
/* Macro defined for AHB2 Base address */
#define AHB2_BASE_ADDR              0X48000000UL

/* Base address of peripherals which are on AHB2 BUS */
/* Macro defined for GPIOA Base address */
#define GPIOA_BASE_ADDR				(AHB2_BASE_ADDR + 0X0000)
/* Macro defined for GPIOB Base address */
#define GPIOB_BASE_ADDR				(AHB2_BASE_ADDR + 0X0400)
/* Macro defined for GPIOC Base address */
#define GPIOC_BASE_ADDR				(AHB2_BASE_ADDR + 0X0800)
/* Macro defined for GPIOD Base address */
#define GPIOD_BASE_ADDR				(AHB2_BASE_ADDR + 0X0C00)
/* Macro defined for GPIOE Base address */
#define GPIOE_BASE_ADDR				(AHB2_BASE_ADDR + 0X1000)
/* Macro defined for GPIOF Base address */
#define GPIOF_BASE_ADDR				(AHB2_BASE_ADDR + 0X1400)
/* Macro defined for GPIOG Base address */
#define GPIOG_BASE_ADDR				(AHB2_BASE_ADDR + 0X1800)
/* Macro defined for GPIOH Base address */
#define GPIOH_BASE_ADDR				(AHB2_BASE_ADDR + 0X1C00)
/* Macro defined for OTG FS Base address */
#define OTG_FS_BASE_ADDR			0X50000000UL
/* Macro defined for ADC Base address */
#define ADC_BASE_ADDR				0X50040000UL
/* Macro defined for AES Base address */
#define AES_BASE_ADDR				0X50060000UL
/* Macro defined for RNG Base address */
#define RNG_BASE_ADDR				0X50060800UL

/* Base address of peripherals which are on AHB1 BUS */
/* Macro defined for DMA1 Base address */
#define DMA1_BASE_ADDR				(AHB1_BASE_ADDR + 0X0000)
/* Macro defined for DMA2 Base address */
#define DMA2_BASE_ADDR				(AHB1_BASE_ADDR + 0X0400)
/* Macro defined for RCC Base address */
#define RCC_BASE_ADDR				(AHB1_BASE_ADDR + 0X1000)
/* Macro defined for Flash Register Base address */
#define FLASHR_BASE_ADDR			(AHB1_BASE_ADDR + 0X2000)
/* Macro defined for CRC Base address */
#define CRC_BASE_ADDR				(AHB1_BASE_ADDR + 0X3000)
/* Macro defined for Touch sensing controller Base address */
#define TSC_BASE_ADDR               (AHB1_BASE_ADDR + 0X4000)


/* Base address of peripherals which are on APB1 BUS */
/* Macro defined for Timer 2 Base address */
#define TIM2_BASE_ADDR				(APB1_BASE_ADDR + 0X0000)
/* Macro defined for Timer 3 Base address */
#define TIM3_BASE_ADDR              (APB1_BASE_ADDR + 0X0400)
/* Macro defined for Timer 4 Base address */
#define TIM4_BASE_ADDR              (APB1_BASE_ADDR + 0X0800)
/* Macro defined for Timer 5 Base address */
#define TIM5_BASE_ADDR              (APB1_BASE_ADDR + 0X0C00)
/* Macro defined for Timer 6 Base address */
#define TIM6_BASE_ADDR              (APB1_BASE_ADDR + 0X1000)
/* Macro defined for Timer 7 Base address */
#define TIM7_BASE_ADDR              (APB1_BASE_ADDR + 0X1400)
/* Macro defined for LCD Base address */
#define LCD_BASE_ADDR               (APB1_BASE_ADDR + 0X2400)
/* Macro defined for RTC Base address */
#define RTC_BASE_ADDR               (APB1_BASE_ADDR + 0X2800)
/* Macro defined for Window Watchdog  Base address */
#define WWDG_BASE_ADDR              (APB1_BASE_ADDR + 0X2C00)
/* Macro defined for Independent Watchdog  Base address */
#define IWDG_BASE_ADDR              (APB1_BASE_ADDR + 0X3000)
/* Macro defined for SPI2 Base address */
#define SPI2_BASE_ADDR              (APB1_BASE_ADDR + 0X3800)
/* Macro defined for SPI3 Base address */
#define SPI3_BASE_ADDR              (APB1_BASE_ADDR + 0X3C00)
/* Macro defined for USART2 Base address */
#define USART2_BASE_ADDR            (APB1_BASE_ADDR + 0X4400)
/* Macro defined for USART3 Base address */
#define USART3_BASE_ADDR            (APB1_BASE_ADDR + 0X4800)
/* Macro defined for UART4  Base address */
#define UART4_BASE_ADDR             (APB1_BASE_ADDR + 0X4C00)
/* Macro defined for UART5 Base address */
#define UART5_BASE_ADDR             (APB1_BASE_ADDR + 0X5000)
/* Macro defined for I2C1 Base address */
#define I2C1_BASE_ADDR              (APB1_BASE_ADDR + 0X5400)
/* Macro defined for I2C2 Base address */
#define I2C2_BASE_ADDR              (APB1_BASE_ADDR + 0X5800)
/* Macro defined for I2C3 Base address */
#define I2C3_BASE_ADDR              (APB1_BASE_ADDR + 0X5C00)
/* Macro defined for CAN1 Base address */
#define CAN1_BASE_ADDR              (APB1_BASE_ADDR + 0X6400)
/* Macro defined for Power control  Base address */
#define PWR_BASE_ADDR               (APB1_BASE_ADDR + 0X7000)
/* Macro defined for DAC1 Base address */
#define DAC1_BASE_ADDR              (APB1_BASE_ADDR + 0X7400)
/* Macro defined for OPAMp Base address */
#define OPAMP_BASE_ADDR             (APB1_BASE_ADDR + 0X7800)
/* Macro defined for Low-Power Timer1  Base address */
#define LPTIM1_BASE_ADDR            (APB1_BASE_ADDR + 0X7C00)
/* Macro defined for Low-Power UART Base address */
#define LPUART1_BASE_ADDR           (APB1_BASE_ADDR + 0X8000)
/* Macro defined for Single Wire Protocol master Base address */
#define SWPMI1_BASE_ADDR            (APB1_BASE_ADDR + 0X8800)
/* Macro defined for Low Power Timer2 Base address */
#define LPTIM2_BASE_ADDR			(APB1_BASE_ADDR + 0X9400)


/* Base address of peripherals which are on APB2 BUS*/
/* Macro defined for system configuration Base address */
#define SYSCFG_BASE_ADDR 			(APB2_BASE_ADDR + 0X0000)
/* Macro defined for VREF Buffer Base address */
#define VREFBUF_BASE_ADDR 			(APB2_BASE_ADDR + 0X0030)
/* Macro defined for Comparator  Base address */
#define COMP_BASE_ADDR 			 	(APB2_BASE_ADDR + 0X0200)
/* Macro defined for EXIT  Base address */
#define EXTI_BASE_ADDR 			 	(APB2_BASE_ADDR + 0X0400)
/* Macro defined for Fire Wall  Base address */
#define FIREWALL_BASE_ADDR 			(APB2_BASE_ADDR + 0X1C00)
/* Macro defined for SDMMC1 Base address */
#define SDMMC1_BASE_ADDR 			(APB2_BASE_ADDR + 0X2800)
/* Macro defined for Timer 1 Base address */
#define TIM1_BASE_ADDR 			 	(APB2_BASE_ADDR + 0X2C00)
/* Macro defined for SPI 1 Base address */
#define SPI1_BASE_ADDR 			 	(APB2_BASE_ADDR + 0X3000)
/* Macro defined for Timer 8 Base address */
#define TIM8_BASE_ADDR 			 	(APB2_BASE_ADDR + 0X3400)
/* Macro defined for USART 1Base address */
#define USART1_BASE_ADDR 			(APB2_BASE_ADDR + 0X3800)
/* Macro defined for Timer 15 Base address */
#define TIM15_BASE_ADDR 			(APB2_BASE_ADDR + 0X4000)
/* Macro defined for Timer 16 Base address */
#define TIM16_BASE_ADDR 			(APB2_BASE_ADDR + 0X4400)
/* Macro defined for Timer 17 Base address */
#define TIM17_BASE_ADDR 			(APB2_BASE_ADDR + 0X4800)
/* Macro defined for Serial Audio Interface 1 Base address */
#define SAI1_BASE_ADDR 			 	(APB2_BASE_ADDR + 0X5400)
/* Macro defined for Serial Audio Interface 2 Base address */
#define SAI2_BASE_ADDR 			    (APB2_BASE_ADDR + 0X5800)
/* Macro defined for Digital Filter for Sigma-Delta Modulator Base address */
#define DFSDM1_BASE_ADDR 			(APB2_BASE_ADDR + 0X6000)
//base address of systick
#define SYSTICK_BASE_ADDR                0xE000E010

/* GPIO Peripheral Defintion*/
/* Macro defined for GPIO port A*/
#define GPIOA 						((GPIO_RegDef_t *)GPIOA_BASE_ADDR)
/* Macro defined for GPIO port B*/
#define GPIOB 						((GPIO_RegDef_t *)GPIOB_BASE_ADDR)
/* Macro defined for GPIO port C*/
#define GPIOC 						((GPIO_RegDef_t *)GPIOC_BASE_ADDR)
/* Macro defined for GPIO port D*/
#define GPIOD 						((GPIO_RegDef_t *)GPIOD_BASE_ADDR)
/* Macro defined for GPIO port E*/
#define GPIOE 						((GPIO_RegDef_t *)GPIOE_BASE_ADDR)
/* Macro defined for GPIO port F*/
#define GPIOF 						((GPIO_RegDef_t *)GPIOF_BASE_ADDR)
/* Macro defined for GPIO port G*/
#define GPIOG 						((GPIO_RegDef_t *)GPIOG_BASE_ADDR)
/* Macro defined for GPIO port H*/
#define GPIOH 						((GPIO_RegDef_t *)GPIOH_BASE_ADDR)

/*RCC Peripheral Defintion */

