santhoshkumar90253/STM32/35_UART_DMA_BareMetal/drivers/inc/stm32lxx.h
#define RCC		                    ((RCC_RegDef_t *)RCC_BASE_ADDR)

#define EXTI		                ((EXTI_RegDef_t *)EXTI_BASE_ADDR)

#define SYSCFG		                ((SYSCFG_RegDef_t *)SYSCFG_BASE_ADDR)

#define SPI1						((SPI_RegDef_t *)SPI1_BASE_ADDR)
#define SPI2						((SPI_RegDef_t *)SPI2_BASE_ADDR)
#define SPI3						((SPI_RegDef_t *)SPI3_BASE_ADDR)

#define I2C1                         ((I2C_RegDef_t *)I2C1_BASE_ADDR)
#define I2C2                         ((I2C_RegDef_t *)I2C2_BASE_ADDR)
#define I2C3                         ((I2C_RegDef_t *)I2C3_BASE_ADDR)

#define USART1						((USART_RegDef_t *)USART1_BASE_ADDR)
#define USART2                      ((USART_RegDef_t *)USART2_BASE_ADDR)
#define USART3						((USART_RegDef_t *)USART3_BASE_ADDR)
#define UART4						((USART_RegDef_t *)UART4_BASE_ADDR)
#define UART5						((USART_RegDef_t *)UART5_BASE_ADDR)

#define ADC1                         ((ADC_RegDef_t*)ADC_BASE_ADDR)
#define ADCOM						 ((ADCOM_RegDef_t *)(ADC_BASE_ADDR+ 0X300UL))

#define TIM2                         ((Tim_RegDef_t *)TIM2_BASE_ADDR)
#define TIM3						 ((Tim_RegDef_t *)TIM3_BASE_ADDR)


// --- RCC (Reset and Clock Control) ---
#define RCC_AHB2ENR_ADCEN       (1U << 13)   // Enable ADC clock on AHB2 bus

// --- ADC Control Register (ADC_CR) ---
#define ADC_CR_ADEN             (1UL << 0U)  // Enable ADC
#define ADC_CR_ADDIS            (1UL << 1U)  // Disable ADC
#define ADC_CR_ADSTART          (1UL << 2U)  // Start regular conversion
#define ADC_CR_ADCAL            (1UL << 31U) // Start ADC calibration
#define ADC_CR_ADVREGEN         (1UL << 28U) // Enable ADC voltage regulator
#define ADC_CR_DEEPPWD          (1UL << 29U) // Enable deep-power-down mode

// --- ADC Common Control Register (ADC_CCR) ---
#define ADC_CCR_CKMODE_Msk      (0x3UL << 16U) // Mask for ADC clock mode bits
#define ADC_CCR_CKMODE          ADC_CCR_CKMODE_Msk
#define ADC_CCR_CKMODE_DIV1     (0x1UL << 16U) // Clock mode: HCLK / 1
#define ADC_CCR_CKMODE_DIV2     (0x2UL << 16U) // Clock mode: HCLK / 2

// --- ADC Interrupt and Status Register (ADC_ISR) ---
#define ADC_ISR_ADRDY           (1UL << 0U)  // ADC ready flag
#define ADC_ISR_EOC             (1UL << 2U)  // End of conversion flag

// --- ADC Regular Sequence Register 1 (ADC_SQR1) ---
#define ADC_SQR1_L_Msk          (0xFUL << 0U)  // Mask for regular channel sequence length
#define ADC_SQR1_L              ADC_SQR1_L_Msk // Sequence length configuration


/* Clock Enable Macros for GPIOx Peripherals */
/* Macro defined To Enable GPIOA Peripheral clock */
#define GPIOA_PCLK_EN()             (RCC -> AHB2ENR |= 1<<0)
/* Macro defined To Enable GPIOB Peripheral clock */
#define GPIOB_PCLK_EN()             (RCC -> AHB2ENR |= 1<<1)
/* Macro defined To Enable GPIOC Peripheral clock */
#define GPIOC_PCLK_EN()             (RCC -> AHB2ENR |= 1<<2)
/* Macro defined To Enable GPIOD Peripheral clock */
#define GPIOD_PCLK_EN()             (RCC -> AHB2ENR |= 1<<3)
/* Macro defined To Enable GPIOE Peripheral clock */
#define GPIOE_PCLK_EN()             (RCC -> AHB2ENR |= 1<<4)
/* Macro defined To Enable GPIOF Peripheral clock */
#define GPIOF_PCLK_EN()             (RCC -> AHB2ENR |= 1<<5)
/* Macro defined To Enable GPIOG Peripheral clock */
#define GPIOG_PCLK_EN()             (RCC -> AHB2ENR |= 1<<6)
/* Macro defined To Enable GPIOH Peripheral clock */
#define GPIOH_PCLK_EN()             (RCC -> AHB2ENR |= 1<<7)


/*Clock Enable Macros for I2C Peripherals*/
/* Macro defined To Enable I2C1 Peripheral clock */
#define I2C1_PCLK_EN()              (RCC -> APB1ENR1 |= 1<<21)
/* Macro defined To Enable I2C2 Peripheral clock */
#define I2C2_PCLK_EN()              (RCC -> APB1ENR1 |= 1<<22)
/* Macro defined To Enable I2C3 Peripheral clock */
#define I2C3_PCLK_EN()              (RCC -> APB1ENR1 |= 1<<23)


/*Clock Enable Macros for SPI Peripherals*/
/* Macro defined To Enable SPI1 Peripheral clock */
#define SPI1_PCLK_EN()              (RCC -> APB2ENR  |= 1<<12)
/* Macro defined To Enable SPI2 Peripheral clock */
#define SPI2_PCLK_EN()              (RCC -> APB1ENR1 |= 1<<14)
/* Macro defined To Enable SPI3 Peripheral clock */
#define SPI3_PCLK_EN()              (RCC -> APB1ENR1 |= 1<<15)

/*Clock Enable Macros for UART Peripherals*/
/* Macro defined To Enable USART1 Peripheral clock */
#define USART1_PCLK_EN()       	    (RCC -> APB2ENR  |= 1<<14)
/* Macro defined To Enable USART2 Peripheral clock */
#define USART2_PCLK_EN()		    (RCC -> APB1ENR1 |= 1<<17)
/* Macro defined To Enable USART3 Peripheral clock */
#define USART3_PCLK_EN()		    (RCC -> APB1ENR1 |= 1<<18)
/* Macro defined To Enable UART4 Peripheral clock */
#define UART4_PCLK_EN()		        (RCC -> APB1ENR1 |= 1<<19)
/* Macro defined To Enable UART5 Peripheral clock */
#define UART5_PCLK_EN()		        (RCC -> APB1ENR1 |= 1<<20)

/*Clock Enable Macros for SYSCFG*/
/* Macro defined To Enable System Config   Peripheral clock */
#define SYSCFG_PCLK_EN()            (RCC -> APB2ENR |=1<<0)


/* Clock Disable Macros for GPIO Peripherals  */
/* Macro defined To Disable GPIOA Peripheral clock */
#define GPIOA_PCLK_DI()             (RCC -> AHB2ENR &= ~(1<<0))
/* Macro defined To Disable GPIOB Peripheral clock */
#define GPIOB_PCLK_DI()             (RCC -> AHB2ENR &= ~(1<<1))
/* Macro defined To Disable GPIOC Peripheral clock */
#define GPIOC_PCLK_DI()             (RCC -> AHB2ENR &= ~(1<<2))
/* Macro defined To Disable GPIOD Peripheral clock */
#define GPIOD_PCLK_DI()             (RCC -> AHB2ENR &= ~(1<<3))
/* Macro defined To Disable GPIOE Peripheral clock */
#define GPIOE_PCLK_DI()             (RCC -> AHB2ENR &= ~(1<<4))
/* Macro defined To Disable GPIOF Peripheral clock */
#define GPIOF_PCLK_DI()             (RCC -> AHB2ENR &= ~(1<<5))
/* Macro defined To Disable GPIOG Peripheral clock */
#define GPIOG_PCLK_DI()             (RCC -> AHB2ENR &= ~(1<<6))
/* Macro defined To Disable GPIOH Peripheral clock */
#define GPIOH_PCLK_DI()             (RCC -> AHB2ENR &= ~(1<<7))

/*Clock Disable Macros for I2C Peripherals*/
/* Macro defined To Disable I2C1 Peripheral clock */
#define I2C1_PCLK_DI()              (RCC -> APB1ENR1 &= ~(1<<21))
/* Macro defined To Disable I2C2 Peripheral clock */
#define I2C2_PCLK_DI()              (RCC -> APB1ENR1 &= ~(1<<22))
/* Macro defined To Disable I2C3 Peripheral clock */
#define I2C3_PCLK_DI()              (RCC -> APB1ENR1 &= ~(1<<23))

/*Clock Disable Macros for SPI Peripherals*/
/* Macro defined To Disable SPI1 Peripheral clock */
#define SPI1_PCLK_DI()              (RCC -> APB2ENR  &= ~(1<<12))
/* Macro defined To Disable SPI2 Peripheral clock */
#define SPI2_PCLK_DI()              (RCC -> APB1ENR1 &= ~(1<<14))
/* Macro defined To Disable SPI3 Peripheral clock */
#define SPI3_PCLK_DI()              (RCC -> APB1ENR1 &= ~(1<<15))

/*Clock Disable Macros for UART Peripherals*/
/* Macro defined To Disable USART1 Peripheral clock */
#define USART1_PCLK_DI()       	    (RCC -> APB2ENR  &= ~(1<<14))
/* Macro defined To Disable USART2 Peripheral clock */
#define USART2_PCLK_DI()		    (RCC -> APB1ENR1 &= ~(1<<17))
/* Macro defined To Disable USART3 Peripheral clock */
#define USART3_PCLK_DI()		    (RCC -> APB1ENR1 &= ~(1<<18))
/* Macro defined To Disable UART4 Peripheral clock */
#define UART4_PCLK_DI()		        (RCC -> APB1ENR1 &= ~(1<<19))
/* Macro defined To Disable UART5 Peripheral clock */
#define UART5_PCLK_DI()		        (RCC -> APB1ENR1 &= ~(1<<20))

/*  Clock Disable Macros for SYSCFG */
/* Macro defined To Disable System Config   Peripheral clock */
#define SYSCFG_PCLK_DI()            (RCC -> APB2ENR &=~(1<<0))

/*Macros to Reset GPIOx Peripherals */
/* Macro defined for GPIOA Reset Register */
#define GPIOA_REG_RESET()			do{(RCC -> AHB2RSTR |= (1<<0)); RCC -> AHB2RSTR &= ~(1<<0);}while(0)
/* Macro defined for GPIOB Reset Register */
#define GPIOB_REG_RESET()			do{(RCC -> AHB2RSTR |= (1<<1)); RCC -> AHB2RSTR &= ~(1<<1);}while(0)
/* Macro defined for GPIOC Reset Register */
#define GPIOC_REG_RESET()			do{(RCC -> AHB2RSTR |= (1<<2)); RCC -> AHB2RSTR &= ~(1<<2);}while(0)
/* Macro defined for GPIOD Reset Register */
#define GPIOD_REG_RESET()			do{(RCC -> AHB2RSTR |= (1<<3)); RCC -> AHB2RSTR &= ~(1<<3);}while(0)
/* Macro defined for GPIOE Reset Register */
#define GPIOE_REG_RESET()			do{(RCC -> AHB2RSTR |= (1<<4)); RCC -> AHB2RSTR &= ~(1<<4);}while(0)
/* Macro defined for GPIOF Reset Register */
#define GPIOF_REG_RESET()			do{(RCC -> AHB2RSTR |= (1<<5)); RCC -> AHB2RSTR &= ~(1<<5);}while(0)
/* Macro defined for GPIOG Reset Register */
#define GPIOG_REG_RESET()			do{(RCC -> AHB2RSTR |= (1<<6)); RCC -> AHB2RSTR &= ~(1<<6);}while(0)
/* Macro defined for GPIOH Reset Register */
#define GPIOH_REG_RESET()			do{(RCC -> AHB2RSTR |= (1<<7)); RCC -> AHB2RSTR &= ~(1<<7);}while(0)

