santhoshkumar90253/STM32/35_UART_DMA_BareMetal/drivers/inc/stm32lxx.h
#define GPIO_BASEADDR_TO_CODE(x)   (( x == GPIOA)? 0:\
									( x == GPIOB)? 1:\
									( x == GPIOC)? 2:\
									( x == GPIOD)? 3:\
									( x == GPIOE)? 4:\
									( x == GPIOF)? 5:\
									( x == GPIOG)? 6:\
									( x == GPIOH)? 7:0)
/* NVIC Configuration */
#define NVIC_ISER0     					((__vo uint32_t *) 0xE000E100)
#define NVIC_ISER1     					((__vo uint32_t *) 0xE000E104)
#define NVIC_ISER2     					((__vo uint32_t *) 0xE000E108)
#define NVIC_ISER3     					((__vo uint32_t *) 0xE000E10C)
#define NVIC_ISER4    		 			((__vo uint32_t *) 0xE000E110)
#define NVIC_ISER5     					((__vo uint32_t *) 0xE000E114)

#define NVIC_ICER0     					((__vo uint32_t *) 0XE000E180)
#define NVIC_ICER1     					((__vo uint32_t *) 0xE000E184)
#define NVIC_ICER2     					((__vo uint32_t *) 0xE000E188)
#define NVIC_ICER3     					((__vo uint32_t *) 0xE000E18C)
#define NVIC_ICER4     					((__vo uint32_t *) 0xE000E190)
#define NVIC_ICER5     					((__vo uint32_t *) 0xE000E194)

#define NVIC_PR_BASE_ADDR  				((__vo uint32_t *)  0xE000E400)
#define NO_PR_BITS_IMPLEMENTED   		4

/* EXT Interrupt Configuration no */

#define IRQ_NO_EXTI0   					6
#define IRQ_NO_EXTI1   					7
#define IRQ_NO_EXTI2   					8
#define IRQ_NO_EXTI3   					9
#define IRQ_NO_EXTI4   					10
#define IRQ_NO_EXTI9_5   				23
#define IRQ_NO_EXTI15_10   				40

#define IRQ_NO_USART1	    			37
#define IRQ_NO_USART2	    			38
#define IRQ_NO_USART3	    			39
#define IRQ_NO_UART4	    			52
#define IRQ_NO_UART5	    			53

#define IRQ_NO_SPI1						35
#define IRQ_NO_SPI2						36
#define IRQ_NO_SPI3						51

#define I2C_CR1_ACK     10
/* I2C_CR1 bits */
#define I2C_CR1_PE       0   /* Peripheral enable */
#define I2C_CR1_TXIE     1   /* TX interrupt enable */
#define I2C_CR1_RXIE     2   /* RX interrupt enable */
#define I2C_CR1_ADDRIE   3   /* Address match interrupt enable */
#define I2C_CR1_NACKIE   4   /* NACK received interrupt enable */
#define I2C_CR1_STOPIE   5   /* STOP detection interrupt enable */
#define I2C_CR1_TCIE     6   /* Transfer complete interrupt enable */
#define I2C_CR1_ERRIE    7   /* Error interrupt enable */
#define I2C_CR1_ACK      10  /* ACK enable */

/* I2C_ISR bits */
#define I2C_ISR_TXE      0   /* TXDR empty */
#define I2C_ISR_TXIS     1   /* TX interrupt status (TXDR empty and ready) */
#define I2C_ISR_RXNE     2   /* RXDR not empty */
#define I2C_ISR_ADDR     3   /* Address matched */
#define I2C_ISR_NACKF    4   /* NACK received */
#define I2C_ISR_STOPF    5   /* STOP detection */
#define I2C_ISR_TC       6   /* Transfer complete */
#define I2C_ISR_TCR      7   /* Transfer complete reload */
#define I2C_ISR_BERR     8   /* Bus error */
#define I2C_ISR_ARLO     9   /* Arbitration lost */
#define I2C_ISR_OVR      10  /* Overrun/underrun */

/* I2C_ICR bits (write 1 to clear) */
#define I2C_ICR_ADDRCF   3   /* Clear ADDR flag */
#define I2C_ICR_NACKCF   4   /* Clear NACK flag */
#define I2C_ICR_STOPCF   5   /* Clear STOP flag */
#define I2C_ICR_BERRCF   8   /* Clear Bus error */
#define I2C_ICR_ARLOCF   9   /* Clear Arbitration lost */
#define I2C_ICR_OVRCF    10  /* Clear Overrun/underrun */

/* Possible Priority level numbers */
#define NVIC_IRQ_PRI0                   0
#define NVIC_IRQ_PRI1                   1
#define NVIC_IRQ_PRI2                   2
#define NVIC_IRQ_PRI3                   3
#define NVIC_IRQ_PRI4                   4
#define NVIC_IRQ_PRI5                   5
#define NVIC_IRQ_PRI6                   6
#define NVIC_IRQ_PRI7                   7
#define NVIC_IRQ_PRI8                   8
#define NVIC_IRQ_PRI9                   9
#define NVIC_IRQ_PRI10                  10
#define NVIC_IRQ_PRI11                  11
#define NVIC_IRQ_PRI12                  12
#define NVIC_IRQ_PRI13                  13
#define NVIC_IRQ_PRI14                  14
#define NVIC_IRQ_PRI15                  15
#define NVIC_IRQ_PRI16                  16

/* Bit Position defination of SPI Peripheral */
#define SPI_CR1_CPHA                  0
#define SPI_CR1_CPOL                  1
#define SPI_CR1_MSTR                  2
#define SPI_CR1_BR                    3
#define SPI_CR1_DFF                   8
#define SPI_CR1_RXONLY                10
#define SPI_CR1_BIDIMODE              15

/* USART and UART Macro's */

#define USART_CR1_UE 					0
#define USART_CR1_UESM 					1
#define USART_CR1_RE  					2
#define USART_CR1_TE 					3
#define USART_CR1_IDLEIE 				4
#define USART_CR1_RXNEIE  				5
#define USART_CR1_TCIE					6
#define USART_CR1_TXEIE					7
#define USART_CR1_PEIE 					8
#define USART_CR1_PS 					9
#define USART_CR1_PCE 					10
#define USART_CR1_WAKE  				11
#define USART_CR1_M 					12
#define USART_CR1_OVER8  				15

#define USART_CR2_ADD   				4
#define USART_CR2_LBDL   				5
#define USART_CR2_LBDIE  				6
#define USART_CR2_LBCL   				8
#define USART_CR2_CPHA   				9
#define USART_CR2_CPOL   				10
#define USART_CR2_STOP   				12
#define USART_CR2_LINEN   				14

#define USART_CR3_EIE					0
#define USART_CR3_IREN					1
#define USART_CR3_IRLP					2
#define USART_CR3_HDSEL					3
#define USART_CR3_NACK					4
#define USART_CR3_SCEN					5
#define USART_CR3_DMAR					6
#define USART_CR3_DMAT					7
#define USART_CR3_RTSE					8
#define USART_CR3_CTSE					9
#define USART_CR3_CTSIE					10
#define USART_CR3_ONEBIT				11

#define USART_ISR_PE					0
#define USART_ISR_FE					1
#define USART_ISR_NF					2
#define USART_ISR_ORE					3
#define USART_ISR_IDLE					4
#define USART_ISR_RXNE					5
#define USART_ISR_TC					6
#define USART_ISR_TXE					7
#define USART_ISR_LBDF					8
#define USART_ISR_CTSIF					9
#define USART_ISR_CTS					10

#define DMA1_Channel7				 ((DMA1_RegDef_t *)(DMA1_BASE_ADDR + 0X080))
#define DMA1_CSELR					 ((DMA1_CSELR_RegDef_t *)(DMA1_BASE_ADDR + 0XA8))

#define DMA1_Channel6				 ((DMA1_RegDef_t *)(DMA1_BASE_ADDR + 0X6C))

#define DMA1					     ((DMA_RegDef_t *)DMA1_BASE_ADDR)


#define SysTick 						((Systick_RegDef_t *)SYSTICK_BASE_ADDR)

/****************************************************** ENF OF MACROS ************************************************/

/**********************************************************************************************************************
 * ENUMS
 *********************************************************************************************************************/

