santhoshkumar90253/STM32/35_UART_DMA_BareMetal/drivers/inc/stm32lxx.h
/****************************************************** END OF ENUM **************************************************/
/**********************************************************************************************************************
 * TYPEDEFS
 *********************************************************************************************************************/

typedef struct
{
	/** GPIO port mode register */
	__vo uint32_t MODER;

	/** GPIO port output type register */
	__vo uint32_t OTYPER;

	/** GPIO port output speed register */
	__vo uint32_t OSPEEDR;

	/** GPIO port pull-up/pull-down register */
	__vo uint32_t PUPDR;

	/** GPIO port input data register */
	__vo uint32_t IDR;

	/** GPIO port output data register */
	__vo uint32_t ODR;

	/** GPIO port bit set/reset register */
	__vo uint32_t BSRR;

	/** GPIO port configuration lock register */
	__vo uint32_t LCKR;

	/** GPIO alternate function registers AFR[0] = AFRL , AFR[1] = AFRH  */
	__vo uint32_t AFR[2];

	/** GPIO port bit reset register */
	__vo uint32_t BRR;

	/** GPIO analog switch control register */
	__vo uint32_t ASCR;

}GPIO_RegDef_t;

typedef struct
{
	 /** Clock control register */
	    __vo uint32_t CR;

	    /** Internal clock sources calibration register */
	    __vo uint32_t ICSCR;

	    /** Clock configuration register */
	    __vo uint32_t CFGR;

	    /** PLL configuration register */
	    __vo uint32_t PLLCFGR;

	    /** PLLSAI1 configuration register */
	    __vo uint32_t PLLSAI1CFGR;

	    /** PLLSAI2 configuration register */
	    __vo uint32_t PLLSAI2CFGR;

	    /** Clock interrupt enable register */
	    __vo uint32_t CIER;

	    /** Clock interrupt flag register */
	    __vo uint32_t CIFR;

	    /** Clock interrupt clear register */
	    __vo uint32_t CICR;

	    /** Reserved */
	    __vo uint32_t RESERVED0;

	    /** AHB1 peripheral reset register */
	    __vo uint32_t AHB1RSTR;

	    /** AHB2 peripheral reset register */
	    __vo uint32_t AHB2RSTR;

	    /** AHB3 peripheral reset register */
	    __vo uint32_t AHB3RSTR;

	    /** Reserved */
	    __vo uint32_t RESERVED1;

	    /** APB1 peripheral reset register 1 */
	    __vo uint32_t APB1RSTR1;

	    /** APB1 peripheral reset register 2 */
	    __vo uint32_t APB1RSTR2;

	    /** APB2 peripheral reset register */
	    __vo uint32_t APB2RSTR;

	    /** Reserved */
	    __vo uint32_t RESERVED2;

	    /** AHB1 peripheral clock enable register */
	    __vo uint32_t AHB1ENR;

	    /** AHB2 peripheral clock enable register */
	    __vo uint32_t AHB2ENR;

	    /** AHB3 peripheral clock enable register */
	    __vo uint32_t AHB3ENR;

	    /** Reserved */
	    __vo uint32_t RESERVED3;

	    /** APB1 peripheral clock enable register 1 */
	    __vo uint32_t APB1ENR1;

	    /** APB1 peripheral clock enable register 2 */
	    __vo uint32_t APB1ENR2;

	    /** APB2 peripheral clock enable register */
	    __vo uint32_t APB2ENR;

	    /** Reserved */
	    __vo uint32_t RESERVED4;

	    /** AHB1 peripheral clock enable in sleep mode register */
	    __vo uint32_t AHB1SMENR;

	    /** AHB2 peripheral clock enable in sleep mode register */
	    __vo uint32_t AHB2SMENR;

	    /** AHB3 peripheral clock enable in sleep mode register */
	    __vo uint32_t AHB3SMENR;

	    /** Reserved */
	    __vo uint32_t RESERVED5;

	    /** APB1 peripheral clock enable in sleep mode register 1 */
	    __vo uint32_t APB1SMENR1;

	    /** APB1 peripheral clock enable in sleep mode register 2 */
	    __vo uint32_t APB1SMENR2;

	    /** APB2 peripheral clock enable in sleep mode register */
	    __vo uint32_t APB2SMENR;

	    /** Reserved */
	    __vo uint32_t RESERVED6;

	    /** Peripherals independent clock configuration register */
	    __vo uint32_t CCIPR;

	    /** Reserved */
	    __vo uint32_t RESERVED7;

	    /** Backup domain control register */
	    __vo uint32_t BDCR;

	    /** Control/status register */
	    __vo uint32_t CSR;

	    /** Clock recovery RC register */
	    __vo uint32_t CRRCR;

	    /** Peripherals independent clock configuration register 2 */
	    __vo uint32_t CCIPR2;

}RCC_RegDef_t;

/* peripheral register defination structure for EXTI */

typedef struct{
	__vo uint32_t IMR1;
	__vo uint32_t EMR1;
	__vo uint32_t RTSR1;
	__vo uint32_t FTSR1;
	__vo uint32_t SWIER1;
	__vo uint32_t PR1;
	__vo uint32_t reserved[2];
	__vo uint32_t IMR2;
	__vo uint32_t EMR2;
	__vo uint32_t RTSR2;
	__vo uint32_t FTSR2;
	__vo uint32_t SWIER2;
	__vo uint32_t PR2;
}EXTI_RegDef_t;

/* Peripheral register defination structure for SYSCFG */
typedef struct{
	__vo uint32_t MEMRMP;
	__vo uint32_t CFGR1;
	__vo uint32_t EXTICR[4];
	__vo uint32_t SCSR;
	__vo uint32_t CFGR2;
	__vo uint32_t SWPR;
	__vo uint32_t SKR;
	uint8_t reserved0;
	__vo uint32_t SWPR2;

}SYSCFG_RegDef_t;

/* SPI Structure definition */

typedef struct{
	__vo uint32_t CR1;
	__vo uint32_t CR2;
	__vo uint32_t SR;
	__vo uint32_t DR;
	__vo uint32_t CRCPR;
	__vo uint32_t RXCRCR;
	__vo uint32_t TXCRCR;
}SPI_RegDef_t;

/* USART Structure Defination */
typedef struct
{
	__vo uint32_t CR1;
	__vo uint32_t CR2;
	__vo uint32_t CR3;
	__vo uint32_t BRR;
	__vo uint32_t GTPR;
	// uint16_t res0;
	__vo uint32_t RTQR;
	__vo uint32_t RQR;
	// uint16_t res1;
	__vo uint32_t ISR;
	__vo uint32_t ICR;
	__vo uint32_t RDR;
	// uint16_t res2;
	__vo uint32_t TDR;
	// uint16_t res3;
}USART_RegDef_t;

/* I2C Structure Defination */
typedef struct
{
	__vo uint32_t CR1;
	__vo uint32_t CR2;
	__vo uint32_t OAR1;
	__vo uint32_t OAR2;
	__vo uint32_t TIMEINGR;
	__vo uint32_t TIMEOUTR;
	__vo uint32_t ISR;
	__vo uint32_t ICR;
	__vo uint32_t PECR;
	__vo uint32_t RXDR;
	__vo uint32_t TXDR;
}I2C_RegDef_t;

/* DMA Structure Defination */
typedef struct
{
	__vo uint32_t CCR;
	__vo uint32_t CNDTR;
	__vo uint32_t CPAR;
	__vo uint32_t CMAR;
}DMA1_RegDef_t;

typedef struct
{
	__vo uint32_t CSELR;
}DMA1_CSELR_RegDef_t;

