santhoshkumar90253/STM32/35_UART_DMA_BareMetal/drivers/inc/stm32lxx.h
typedef struct {
	__vo uint32_t ISR;
	__vo uint32_t IFCR;
}DMA_RegDef_t;
/*
 *  ADC Structure Definition
 */

typedef struct{
	__vo uint32_t ISR;
	__vo uint32_t IER;
	__vo uint32_t CR;
	__vo uint32_t CFGR;
	__vo uint32_t CFGR2;
	__vo uint32_t SMPR1;
	__vo uint32_t SMPR2;
	__vo uint32_t res0;
	__vo uint32_t TR1;
	__vo uint32_t TR2;
	__vo uint32_t TR3;
	__vo uint32_t SQR1;
	__vo uint32_t SQR2;
	__vo uint32_t SQR3;
	__vo uint32_t SQR4;
	__vo uint32_t DR;

}ADC_RegDef_t;


/* ADC Common Register Structure */

typedef struct{
	__vo uint32_t CSR;
	uint32_t res0;
	__vo uint32_t CCR;
	__vo uint32_t CDR;
}ADCOM_RegDef_t;


/* Timer Register Structure */

typedef struct{
	__vo uint32_t CR1;
	__vo uint32_t CR2;
	__vo uint32_t SMCR;
	__vo uint32_t DIER;
	__vo uint32_t SR;
	__vo uint32_t EGR;
	__vo uint32_t CCMR1;
	__vo uint32_t CCMR2;
	__vo uint32_t CCER;
	__vo uint32_t CNT;
	__vo uint32_t PSC;
	__vo uint32_t ARR;
	__vo uint32_t CCR1;
	__vo uint32_t CCR2;
	__vo uint32_t CCR3;
	__vo uint32_t CCR4;

}Tim_RegDef_t;

/*systick register definiton*/
typedef struct{
	__vo uint32_t CSR;
	__vo uint32_t RVR;
	__vo uint32_t CVR;
	__vo uint32_t CALIB;
}Systick_RegDef_t;

/****************************************************** END OF TYPEDEF ***********************************************/


/**********************************************************************************************************************
 * GLOBAL VARIABLES
 *********************************************************************************************************************/

/*************************************************** END OF GLOBAL VARIABLES******************************************/

/**********************************************************************************************************************
 * FUNCTION PROTOTYPES
 *********************************************************************************************************************/

/************************************************** END OF FUNCTION PROTOTYPES ***************************************/



#endif /* INC_STM32LXX_H_ */
